Охотники_и_рыболовы/src/Reports/ВыдачаРазрешений/ВыдачаРазрешений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВыдачаРазрешений</name>
  <attributes>
    <name>ОсновнаяОрганизация</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоОхоты</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодОтчета</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматОтчета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматДичи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ОтчетныеВидыДичи</types>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </attributes>
</mdclass:Report>

Охотники_и_рыболовы/src/Reports/ВыдачаРазрешений/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Если ЭтотОбъект.ФорматДичи и ЭтотОбъект.ФорматОтчета Тогда
			ИмяГруппировки = "ТО";
	ИначеЕсли  НЕ ЭтотОбъект.ФорматДичи и ЭтотОбъект.ФорматОтчета Тогда
			ИмяГруппировки = "ДО";
	ИначеЕсли НЕ ЭтотОбъект.ФорматОтчета и ЭтотОбъект.ФорматДичи Тогда
			 ИмяГруппировки = "ТП";
	Иначе
			 ИмяГруппировки = "ДП";
	КонецЕсли;	
		
	Для Каждого ГруппировкаСКД Из КомпоновщикНастроек.Настройки.Структура Цикл
			ГруппировкаСКД.Использование = ?(ГруппировкаСКД.Имя = ИмяГруппировки, Истина, Ложь);
	КонецЦикла;

	Охотхозяйство = ЭтотОбъект.ОсновнаяОрганизация;
	Если НЕ Охотхозяйство.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ОхотхозяйствоПользователя",Охотхозяйство);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОхотхозяйствоПользователя").Использование =Ложь;
	КонецЕсли;	
	
	МестоОхоты = ЭтотОбъект.МестоОхоты;
	Если НЕ МестоОхоты.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МестоОхоты",МестоОхоты);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("МестоОхоты").Использование =Ложь;
	КонецЕсли;	
	
	ВидДичи = ЭтотОбъект.ВидДичи;
	Если НЕ ВидДичи.Пустая() Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидДичи",ВидДичи);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВидДичи")).Использование =Ложь;
	КонецЕсли;	


	ПериодОтчета = ЭтотОбъект.ПериодОтчета;
	Если ЗначениеЗаполнено(ПериодОтчета) Тогда
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПериодОтчета",ПериодОтчета);
	Иначе
		КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета")).Использование =Ложь;
	КонецЕсли;	

	ОхотаСервер.ЗаполнитьЗаголовокОтчета(ЭтотОбъект);
	
КонецПроцедуры
